# ConnectionValidationInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationInfo Class
Members See Also
---
This object contains information about fabrication connection validations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class ConnectionValidationInfo : IDisposable
```

Visual Basic
---
```text
Public Class ConnectionValidationInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ConnectionValidationInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ConnectionValidationInfo
# See Also
ConnectionValidationInfo Members
Autodesk.Revit.DB Namespace